ram4-dev/esp32-hermes-voice/firmware/sdkconfig.defaults
# Waveshare ESP32-S3-Touch-AMOLED-2.06 hardware defaults.
CONFIG_IDF_TARGET="esp32s3"
CONFIG_ESPTOOLPY_FLASHMODE_QIO=y
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"
CONFIG_PARTITION_TABLE_FILENAME="partitions.csv"
CONFIG_COMPILER_OPTIMIZATION_PERF=y
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_FETCH_INSTRUCTIONS=y
CONFIG_SPIRAM_RODATA=y
CONFIG_SPIRAM_SPEED_80M=y
CONFIG_SPIRAM_MALLOC_ALWAYSINTERNAL=4096
CONFIG_SPIRAM_MALLOC_RESERVE_INTERNAL=65536
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_240=y
CONFIG_FREERTOS_HZ=1000
CONFIG_MBEDTLS_CERTIFICATE_BUNDLE=y
CONFIG_LV_FONT_MONTSERRAT_16=y
CONFIG_LV_FONT_MONTSERRAT_20=y
CONFIG_LV_FONT_MONTSERRAT_28=y
CONFIG_LV_THEME_DEFAULT_DARK=y
CONFIG_LV_USE_LOG=y
CONFIG_BSP_DISPLAY_LVGL_BUF_HEIGHT=40
CONFIG_VOICE_BRIDGE_URL="https://hermes-server.tailfb789f.ts.net:8443"
CONFIG_VOICE_WIFI_PRIMARY_SSID="Ramiro-2.4Ghz"
CONFIG_VOICE_WIFI_SECONDARY_SSID="Rama"
